vmidentity/sts/src/test/resources/request/invalid_signature_2.xml

<?xml version='1.0' encoding='UTF-8'?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header><ns5:Security xmlns="http://docs.oasis-open.org/ws-sx/ws-trust/200512" xmlns:ns2="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:ns3="http://www.rsa.com/names/2009/12/std-ext/WS-Trust1.4/advice" xmlns:ns4="http://www.w3.org/2005/08/addressing" xmlns:ns5="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><ns2:Timestamp ns2:Id="_8ee69185-9dfc-4c93-b78c-9f5547b2bbe8"><ns2:Created>2012-05-15T16:44:46.152Z</ns2:Created><ns2:Expires>2012-05-15T16:54:45.152Z</ns2:Expires></ns2:Timestamp><ns5:UsernameToken><ns5:Username>administrator@csp.com</ns5:Username><ns5:Password>vmware</ns5:Password></ns5:UsernameToken><ns2:BinarySecurityToken xmlns:ns1="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:ns2="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:ns3="http://docs.oasis-open.org/ws-sx/ws-trust/200512" xmlns:ns4="http://www.rsa.com/names/2009/12/std-ext/WS-Trust1.4/advice" xmlns:ns5="http://www.w3.org/2005/08/addressing" EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" ns1:Id="_80901108-30af-4c93-951b-65e2c44dc560">MIIDRjCCAi6gAwIBAgIGATdRYv8aMA0GCSqGSIb3DQEBCwUAMFsxCzAJBgNVBAYTAkJHMQ4wDAYD&#xd;
VQQIEwVTb2ZpYTEOMAwGA1UEBxMFU29maWExDzANBgNVBAoTBlZNd2FyZTEMMAoGA1UECwwDUiZE&#xd;
MQ0wCwYDVQQDEwRVc2VyMB4XDTEyMDUxNTE2NDQyN1oXDTEyMDUxNTE3MDQyN1owWzELMAkGA1UE&#xd;
BhMCQkcxDjAMBgNVBAgTBVNvZmlhMQ4wDAYDVQQHEwVTb2ZpYTEPMA0GA1UEChMGVk13YXJlMQww&#xd;
CgYDVQQLDANSJkQxDTALBgNVBAMTBFVzZXIwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIB&#xd;
AQCF5vQPLusEFwy4TT4Xcm1Fy80f/IV0U4ylAZYbf4ZiUqe141W3WJ9lMT/YHs3dMQZ9bQCNNU1s&#xd;
kQOtW6ZlZE8Zu6CksDobD+xR8LVhFwt2ZGe3T3mvbtoPZGrGpuhHjXsByRW8TB7DkIQMJ2QtbkvI&#xd;
Rks5KL8djgWuQexMaz7nzOM+BWc8aX2XAaE6m8TU/8axlpUm5bKO+/qPGxddD+snEQV6i1IyDxNz&#xd;
Dy6clpSB6YdO2RFGZoqJfMYkGT87UUIGuSrkdNRUs4UFlpo7uOEdUO0O9DZED3jvd/EhozcJFbOA&#xd;
qtNBZ41PLS0dDr1oEvwPWvD0tdPowxMUMTI1JWLlAgMBAAGjEDAOMAwGA1UdEwEB/wQCMAAwDQYJ&#xd;
KoZIhvcNAQELBQADggEBADZ24I9CUi7nXhnMOnZStxHOLmJ8RDwsOqZs/E52iNqMbc9WwOfxnWNm&#xd;
veQr8D/yKt4H6qqw+2PGh/5fkGfeuSka2pcOQ7Nd9riYwrn7yoNWj0eaEBXu7RHr5RgI1GsE7+30&#xd;
8viY8AaF1nU1WGqzfSdVXgo0ksPsNwPeNV3AKT2+WjBaCUzC0ipdbMGAATF1vsqfYFiTG6jCDsOE&#xd;
dN6glPEQzhvgr6FzD8s1YsuC6fBvgp/Xx6+1HfeFlbQvetl3GLbOxibzGkYpkwi7RCA2UG90x7y6&#xd;
js2be5JVogyiSSxajbFd6Xw9AF38zg+S3yNtaWuzEsSiO2lXIdbVC4VfMqg=&#xd;
</ns2:BinarySecurityToken><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="_efb87908-cc4a-473e-b4c6-af166f2c8c4a"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#rsa-sha512"/><ds:Reference URI="#_707280bc-046c-46d1-bbcb-62c3500d40e2"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha512"/><ds:DigestValue>XT+p1v3xfiABuLjg5IIF1H+EKv1VN2WJKPbClhNKZdYDK1+0SIU4sMM1pcK+IeU3nQXqQ9jzxm4m
G6VWBMeyxA==</ds:DigestValue></ds:Reference><ds:Reference URI="#_8ee69185-9dfc-4c93-b78c-9f5547b2bbe8"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha512"/><ds:DigestValue>onmJbGG+Z2IW0C67ZuF7VvpWzoyTE6lAxwnRqSM4Z70E/i4b2Zj2XnUKU3MWdP/dhuAa4lktl5iA
vNcxmjMSSQ==</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>fOCuJjiiE8vtP16EinkfoZlIfQeCU7I+6uuKQg340M/lZ3ye5jm/EJGcQTe92yMIkhT4W6/tCpfa
M0lQG8VYLeoUv5IdNvLLJme92bIZj6EWro+X6wrnmYpRxtXO64w9Caoed42Q27pOHlO5H3WFSYxZ
gx5FOR4rh5AaY9WlG+kKg7llg48Q06ZQyPwAHu0CmY1ku5sBfCw7vzuP5+oRR4w4zBfOe2Aefbn4
kFkmMlfPt5wwNiUM/23sE9aWKLaWaPxVQKl8ke30Ps89M7AVAlgT3Gn3zBTN5sXS+DUNrTGfLpDW
kf1+kKVl5Iacc6ubHlf/Vy9h7btBJY2oKEvoNg==</ds:SignatureValue><ds:KeyInfo><ns2:SecurityTokenReference xmlns:ns1="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:ns2="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:ns3="http://docs.oasis-open.org/ws-sx/ws-trust/200512" xmlns:ns4="http://www.rsa.com/names/2009/12/std-ext/WS-Trust1.4/advice" xmlns:ns5="http://www.w3.org/2005/08/addressing"><ns2:Reference URI="#_80901108-30af-4c93-951b-65e2c44dc560" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/></ns2:SecurityTokenReference></ds:KeyInfo></ds:Signature></ns5:Security></SOAP-ENV:Header><SOAP-ENV:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="_707280bc-046c-46d1-bbcb-62c3500d40e2"><RequestSecurityToken xmlns="http://docs.oasis-open.org/ws-sx/ws-trust/200512" xmlns:ns2="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:ns3="http://www.rsa.com/names/2009/12/std-ext/WS-Trust1.4/advice" xmlns:ns4="http://www.w3.org/2005/08/addressing" xmlns:ns5="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><TokenType>urn:oasis:names:tc:SAML:2.0:assertion</TokenType><RequestType>http://docs.oasis-open.org/ws-sx/ws-trust/200512/Issue</RequestType><Lifetime><ns2:Created>2012-05-15T16:44:45.152Z</ns2:Created><ns2:Expires>2012-05-15T16:45:45.152Z</ns2:Expires></Lifetime><Renewing Allow="true" OK="false"/><KeyType>http://docs.oasis-open.org/ws-sx/ws-trust/200512/PublicKey</KeyType><SignatureAlgorithm>http://www.w3.org/2001/04/xmldsig-more#rsa-sha256</SignatureAlgorithm><ns3:UseKey xmlns:ns1="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:ns2="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:ns3="http://docs.oasis-open.org/ws-sx/ws-trust/200512" xmlns:ns4="http://www.rsa.com/names/2009/12/std-ext/WS-Trust1.4/advice" xmlns:ns5="http://www.w3.org/2005/08/addressing" Sig="_efb87908-cc4a-473e-b4c6-af166f2c8c4a"/></RequestSecurityToken></SOAP-ENV:Body></SOAP-ENV:Envelope>